CD2DBrushProperties.CommonInit
Initializes the object

CD2DBrushProperties.#ctor(D2D_MATRIX_3X2_F,System.Single)
Creates a CD2D_BRUSH_PROPERTIES structure
_transform: The transformation to apply to the brush
_opacity: The base opacity of the brush. The default value is 1.0.

CD2DBrushProperties.#ctor(System.Single)
Creates a CD2D_BRUSH_PROPERTIES structure
_opacity: The base opacity of the brush. The default value is 1.0.

CD2DBrushProperties.#ctor
Creates a CD2D_BRUSH_PROPERTIES structure

CD2DBrushProperties
D2D1_BRUSH_PROPERTIES wrapper.